{
  "reviews": {
    "review01": {
      "text": "We’ve gone through 3 purchases and 2 sales with Sharon. We can’t say enough for the entire team. They listen to your needs and find solutions made for you and your family. The process has always been painless and we always felt comfortable. I would give the the highest marks in integrity, knowledge and professionalism.",
      "author": "Carrie C."
    },
    "review02": {
      "text": "Sharon and her team truly exceeded our expectations, they sold our home in Boca Raton sooner than we anticipated and helped us along the way with helpful advice. I wont hesitate to recommend them or use their services again, should we decide to do another real estate deal in the area.",
      "author": "Michael D."
    },
    "review03": {
      "text": "Caron was wonderful to work with and found the right buyer for my 90 year old mothers condo in Delray Beach quickly. She was fast, attentive to details, pleasant and extremely professional. Best of all, she communicated with my sister and I regularly in New York and never missed a beat. She is organized and on top of every detail. I would recommend her strongly to anyone looking to sell their home.",
      "author": "David L."
    },
    "review04": {
      "text": "The Sharon and Caron Group are AWESOME! Caron and Sharon truly work as a TEAM! They also have a wonderful group of support staff. Caron was our primary Realtor at the Sharon and Caron Group, but the way the entire TEAM worked to support the sale and marketing of our home they were all the PRIMARY! Caron and Sharon provided an in depth knowledge of our specific market, provided contacts to assist us in preparing our home for sale (i.e. a stager, or any repairs). Caron and the TEAM truly got our home on the market and closed in a matter of weeks at a market price that was acceptable to both the SELLER and the BUYER. Their assistance was instrumental in our having a smooth closing to this sale. If you are going to LIST your home for sale in South Florida, I would HIGHLY recommend the Sharon and Caron Group.",
      "author": "Jim & Shel D."
    },
    "review05": {
      "text": "My husband and I worked with Sharon Arnett on purchasing a home in Boca Raton. We were moving there from out of town and Sharon really helped familiarize us with the area. It was a big asset to have her as she was very familiar with different locations and specific subdivisions. The first home we made an offer on had some issues during the inspection and she went above and beyond to make sure we were comfortable by bringing out another inspector. We ended up not proceeding with the purchase because of her effort and work on our behalf. We ended up finding a house we loved even more than the first also thanks to her negotiating skills with the selling agent. She also suggested we ask the sellers to make some repairs before we moved in and they agreed! She has been a great asset every step of the way and I would recommend using her team.",
      "author": "Jessie & Victoria B."
    },
    "review06": {
      "text": "The Sharon & Caron Group along with Sweeney are a top notch Real Estate Consultant Group! They are an extremely professional and personable group of women. I would highly recommend them to anyone buying or selling a home. They were very committed to helping us sell our home and with their expertise, they smoothly guided us through the entire process. I felt as if they were always available to answer any questions we had. To top it off, they sold our home for full price in 7 days!!! They are the best in the business.",
      "author": "Pauline M."
    },
    "review07": {
      "text": "Although we had previously listed our home with a different realtor and had nearly fifty showings during that contract duration, we were unsuccessful in selling it. Then we listed our home with Sharon and Caron. They developed a sales plan to address any questions posed by prospective buyers, they introduced a professional stager to the process who made suggestions and some changes, they consulted us about raising the sales price slightly, and then they began the showings. Within a approximately a month we had an offer that we accepted that was within one percent of the listing price. They followed through on all details through the closing and we have been very happy that we chose this team.",
      "author": "Ted & Debbie T."
    }
  }
}